admin_panel/ADMIN_STOCKPERCHASE_DELECTION_TESTING/admin_Stockperchase_DELECTION_testing-Combined-JMeter-and-Selenium.yaml
---
# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: admin_Stockperchase_DELECTION_testing-Selenium
  hold-for: 20m

- executor: jmeter
  scenario: admin_Stockperchase_DELECTION_testing-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  admin_Stockperchase_DELECTION_testing-Selenium:
    browser: Chrome  # available browsers are: ["Firefox", "Chrome", "Ie", "Opera"]
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - go(http://localhost:33143/Administator/Stockperchase)
      # WARN: Command Not yet supported. ('chooseOkOnNextConfirmation:"":""')
      - clickByXPath((//a[contains(text(),'Delete')])[4])
      # WARN: Command Not yet supported. ('assertConfirmation:"Do you want to delete":""')
      # WARN: Command Not yet supported. ('chooseOkOnNextConfirmation:"":""')
      - clickByXPath((//a[contains(text(),'Delete')])[3])
      # WARN: Command Not yet supported. ('assertConfirmation:"Do you want to delete":""')

  admin_Stockperchase_DELECTION_testing-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/71.0.3578.98 Safari/537.36'
      Referer: 'http://localhost:33143/Administator/Stockperchase'
      Accept-Encoding: 'gzip, deflate, br'
      Accept-Language: 'en-US,en;q=0.9'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:33143/Administator/perchaseDelete1004'
            method: GET
            label: 'http://localhost:33143/Administator/perchaseDelete1004'
            headers:
              Accept: '*/*'
              X-Requested-With: XMLHttpRequest
          - url: 'http://localhost:33143/Administator/perchaseDelete/1004'
            method: GET
            label: 'http://localhost:33143/Administator/perchaseDelete/1004'
            think-time: 7ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
          - url: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAABXzpKG23owZ5KtV2R7OeTtpQkUFpV9T9QQxeU3x%2FI4swAAAAAOgAAAAAIAACAAAAAHPhDSeCHN9eh%2FLG%2B8%2Bph80UoPZGyt5daCt5bB23D%2FGjAAAAArcxmz4XbmmdTrnEG6XLt985jWzeWNV7m3RBTPMT%2BGNql4m8dvfJXbRsf1nEk5iPZAAAAAiKRd2FVIQ5kXrXVYyW6wbnSCoFP5crHxxOJBWTFD1SPRb1%2FqLCVNn7eNLiB2EzGkBv0F3HgcMXuefRJAJZVsUQ%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FAdministator%2FStockperchase&browserName=Chrome'
            method: POST
            label: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAABXzpKG23owZ5KtV2R7OeTtpQkUFpV9T9QQxeU3x%2FI4swAAAAAOgAAAAAIAACAAAAAHPhDSeCHN9eh%2FLG%2B8%2Bph80UoPZGyt5daCt5bB23D%2FGjAAAAArcxmz4XbmmdTrnEG6XLt985jWzeWNV7m3RBTPMT%2BGNql4m8dvfJXbRsf1nEk5iPZAAAAAiKRd2FVIQ5kXrXVYyW6wbnSCoFP5crHxxOJBWTFD1SPRb1%2FqLCVNn7eNLiB2EzGkBv0F3HgcMXuefRJAJZVsUQ%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FAdministator%2FStockperchase&browserName=Chrome'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
          - url: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/negotiate'
            method: GET
            label: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/negotiate'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
            body:
              requestUrl: 'http://localhost:33143/Administator/Stockperchase'
              browserName: Chrome
              clientProtocol: '1.3'
              _: '1546071060944'
          - url: 'http://localhost:33143/__browserLink/requestData/4cef088952f14813b979a10c7878c90b'
            method: GET
            label: 'http://localhost:33143/__browserLink/requestData/4cef088952f14813b979a10c7878c90b'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              X-Requested-With: XMLHttpRequest
          - url: 'http://localhost:33143/Administator/perchaseDelete4'
            method: GET
            label: 'http://localhost:33143/Administator/perchaseDelete4'
            headers:
              Accept: '*/*'
              X-Requested-With: XMLHttpRequest
          - url: 'http://localhost:33143/Administator/perchaseDelete/4'
            method: GET
            label: 'http://localhost:33143/Administator/perchaseDelete/4'
            think-time: 14ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
          - url: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAAAaaMnSmHaY2k9J8c%2BwKVlnhygsD2l7n1Xdlamthvr4eQAAAAAOgAAAAAIAACAAAADfDNw2pjYBsCfEPYUj9EctC5HCdCkL0gmxfM7d46SioDAAAADdN8wXnx9viNf%2FsRWpAeqYwqJbZEADACjxO0umsdAjWF%2Fl230MHvV8p04trpS6KAZAAAAAi2sAPHBFCAsDwIEQ4Acj6rAyCmzHZ8UMxIIeS0f4V00xSkx3SeIVoKYxLgAL5Z5z6WzjUnGzaKK7lUx2qo5iEQ%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FAdministator%2FStockperchase&browserName=Chrome'
            method: POST
            label: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAAAaaMnSmHaY2k9J8c%2BwKVlnhygsD2l7n1Xdlamthvr4eQAAAAAOgAAAAAIAACAAAADfDNw2pjYBsCfEPYUj9EctC5HCdCkL0gmxfM7d46SioDAAAADdN8wXnx9viNf%2FsRWpAeqYwqJbZEADACjxO0umsdAjWF%2Fl230MHvV8p04trpS6KAZAAAAAi2sAPHBFCAsDwIEQ4Acj6rAyCmzHZ8UMxIIeS0f4V00xSkx3SeIVoKYxLgAL5Z5z6WzjUnGzaKK7lUx2qo5iEQ%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FAdministator%2FStockperchase&browserName=Chrome'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
          - url: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/negotiate'
            method: GET
            label: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/negotiate'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
            body:
              requestUrl: 'http://localhost:33143/Administator/Stockperchase'
              browserName: Chrome
              clientProtocol: '1.3'
              _: '1546071065150'
          - url: 'http://localhost:33143/__browserLink/requestData/75026b2fbdb046d89da7b3318e9b321d'
            method: GET
            label: 'http://localhost:33143/__browserLink/requestData/75026b2fbdb046d89da7b3318e9b321d'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              X-Requested-With: XMLHttpRequest